# Вычислить число π c заданной точностью *d*
# Пример:
# при d = 0.001, π = 3.141
# при d = 0.1, π = 3.1
# при d = 0.00001, π = 3.14154
# d от 0.1 до 0.0000000001

import math


numberPi = math.pi
print(numberPi)

d = float(input('Задайте точность числа pi (от 0.1 до 0.0000000001): '))

count = 0
if d >= 0.0000000001 and d <= 0.1:
    while d != 1:
        d *= 10
        count += 1        

    print(f'Число знаков после запятой в заданной точности: {count}')
else:
    print('Вы задали некорректную точность')


print(f'Число π c заданной точностью {d/10**count} равно {round(numberPi, count)}')